Revit 2027 API
Document.GetWorksetTable Method
 Get the WorksetTable of this document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public WorksetTable GetWorksetTable()
Public Function GetWorksetTable As WorksetTable
public:
WorksetTable^ GetWorksetTable()
member GetWorksetTable : unit -> WorksetTable
Return Value
WorksetTable
 The WorksetTable of this document.
Remarks
 There is one WorksetTable for each document. There will be at least one workset in the table, even if sharing has not yet been enabled for this document.
See Also
Reference
Document Class
Autodesk.Revit.DB Namespace